cmsis-svd/cmsis-svd/data/Atmel/ATSAME53J19A.svd
               <register>
                  <name>INTENCLR</name>
                  <description>MODE2 Interrupt Enable Clear</description>
                  <addressOffset>0x8</addressOffset>
                  <size>16</size>
                  <resetValue>0x0000</resetValue>
                  <fields>
                     <field>
                        <name>PER0</name>
                        <description>Periodic Interval 0 Interrupt Enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PER1</name>
                        <description>Periodic Interval 1 Interrupt Enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PER2</name>
                        <description>Periodic Interval 2 Interrupt Enable</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PER3</name>
                        <description>Periodic Interval 3 Interrupt Enable</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PER4</name>
                        <description>Periodic Interval 4 Interrupt Enable</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PER5</name>
                        <description>Periodic Interval 5 Interrupt Enable</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PER6</name>
                        <description>Periodic Interval 6 Interrupt Enable</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PER7</name>
                        <description>Periodic Interval 7 Interrupt Enable</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ALARM0</name>
                        <description>Alarm 0 Interrupt Enable</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ALARM1</name>
                        <description>Alarm 1 Interrupt Enable</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TAMPER</name>
                        <description>Tamper Enable</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OVF</name>
                        <description>Overflow Interrupt Enable</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>INTENSET</name>
                  <description>MODE2 Interrupt Enable Set</description>
                  <addressOffset>0xA</addressOffset>
                  <size>16</size>
                  <resetValue>0x0000</resetValue>
                  <fields>
                     <field>
                        <name>PER0</name>
                        <description>Periodic Interval 0 Enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PER1</name>
                        <description>Periodic Interval 1 Enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PER2</name>
                        <description>Periodic Interval 2 Enable</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PER3</name>
                        <description>Periodic Interval 3 Enable</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PER4</name>
                        <description>Periodic Interval 4 Enable</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PER5</name>
                        <description>Periodic Interval 5 Enable</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PER6</name>
                        <description>Periodic Interval 6 Enable</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PER7</name>
                        <description>Periodic Interval 7 Enable</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ALARM0</name>
                        <description>Alarm 0 Interrupt Enable</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ALARM1</name>
                        <description>Alarm 1 Interrupt Enable</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TAMPER</name>
                        <description>Tamper Enable</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OVF</name>
                        <description>Overflow Interrupt Enable</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>INTFLAG</name>
                  <description>MODE2 Interrupt Flag Status and Clear</description>
                  <addressOffset>0xC</addressOffset>
                  <size>16</size>
                  <resetValue>0x0000</resetValue>
                  <fields>
                     <field>
                        <name>PER0</name>
                        <description>Periodic Interval 0</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PER1</name>
                        <description>Periodic Interval 1</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PER2</name>
                        <description>Periodic Interval 2</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PER3</name>
                        <description>Periodic Interval 3</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PER4</name>
                        <description>Periodic Interval 4</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PER5</name>
                        <description>Periodic Interval 5</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PER6</name>
                        <description>Periodic Interval 6</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PER7</name>
                        <description>Periodic Interval 7</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ALARM0</name>
                        <description>Alarm 0</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ALARM1</name>
                        <description>Alarm 1</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TAMPER</name>
                        <description>Tamper</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OVF</name>
                        <description>Overflow</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DBGCTRL</name>
                  <description>Debug Control</description>
                  <addressOffset>0xE</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>DBGRUN</name>
                        <description>Run During Debug</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>SYNCBUSY</name>
                  <description>MODE2 Synchronization Busy Status</description>
                  <addressOffset>0x10</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>SWRST</name>
                        <description>Software Reset Bit Busy</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ENABLE</name>
                        <description>Enable Bit Busy</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>FREQCORR</name>
                        <description>FREQCORR Register Busy</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CLOCK</name>
                        <description>CLOCK Register Busy</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ALARM0</name>
                        <description>ALARM 0 Register Busy</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ALARM1</name>
                        <description>ALARM 1 Register Busy</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>MASK0</name>
                        <description>MASK 0 Register Busy</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>MASK1</name>
                        <description>MASK 1 Register Busy</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CLOCKSYNC</name>
                        <description>Clock Synchronization Enable Bit Busy</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>GP0</name>
                        <description>General Purpose 0 Register Busy</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>GP1</name>
                        <description>General Purpose 1 Register Busy</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>GP2</name>
                        <description>General Purpose 2 Register Busy</description>
                        <bitOffset>18</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>GP3</name>
                        <description>General Purpose 3 Register Busy</description>
                        <bitOffset>19</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>FREQCORR</name>
                  <description>Frequency Correction</description>
                  <addressOffset>0x14</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>VALUE</name>
                        <description>Correction Value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>7</bitWidth>
                     </field>
                     <field>
                        <name>SIGN</name>
                        <description>Correction Sign</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CLOCK</name>
                  <description>MODE2 Clock Value</description>
                  <addressOffset>0x18</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>SECOND</name>
                        <description>Second</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>6</bitWidth>
                     </field>
                     <field>
                        <name>MINUTE</name>
                        <description>Minute</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>6</bitWidth>
                     </field>
                     <field>
                        <name>HOUR</name>
                        <description>Hour</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>5</bitWidth>
                        <enumeratedValues>
                           <name>HOURSelect</name>
                           <enumeratedValue>
                              <name>AM</name>
                              <description>AM when CLKREP in 12-hour</description>
                              <value>0x00</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PM</name>
                              <description>PM when CLKREP in 12-hour</description>
                              <value>0x10</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>DAY</name>
                        <description>Day</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>5</bitWidth>
                     </field>
                     <field>
                        <name>MONTH</name>
                        <description>Month</description>
                        <bitOffset>22</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>YEAR</name>
                        <description>Year</description>
                        <bitOffset>26</bitOffset>
                        <bitWidth>6</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <dim>4</dim>
                  <dimIncrement>4</dimIncrement>
                  <name>GP[%s]</name>
                  <description>General Purpose</description>
                  <addressOffset>0x40</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>GP</name>
                        <description>General Purpose</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>ALARM0</name>
                  <description>MODE2_ALARM Alarm n Value</description>
                  <addressOffset>0x20</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>SECOND</name>
                        <description>Second</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>6</bitWidth>
                     </field>
                     <field>
                        <name>MINUTE</name>
                        <description>Minute</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>6</bitWidth>
                     </field>
                     <field>
                        <name>HOUR</name>
                        <description>Hour</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>5</bitWidth>
                        <enumeratedValues>
                           <name>HOURSelect</name>
                           <enumeratedValue>
                              <name>AM</name>
                              <description>Morning hour</description>
                              <value>0x00</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PM</name>
                              <description>Afternoon hour</description>
                              <value>0x10</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>DAY</name>
                        <description>Day</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>5</bitWidth>
                     </field>
                     <field>
                        <name>MONTH</name>
                        <description>Month</description>
                        <bitOffset>22</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>YEAR</name>
                        <description>Year</description>
                        <bitOffset>26</bitOffset>
                        <bitWidth>6</bitWidth>
                     </field>
                  </fields>
               </register>
